# ReplaceSpareSpaceOnSwitchBoard Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..ReplaceSpareSpaceOnSwitchBoard Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Need to replace spare or space on switchboard.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ReplaceSpareSpaceOnSwitchBoard { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReplaceSpareSpaceOnSwitchBoard As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ReplaceSpareSpaceOnSwitchBoard {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace